app/controllers/students_controller.rb

  def show
    # setting student find by id into an instance variable to access in show page
    @student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]